var gameMod = {
	entry : "入口",
	mods : {
		"入口" : {
			title : "阿瓦隆",
			context : "游戏人数 5~8<br>游戏时间：30~90分钟<br>特色：身份欺骗<br>演示用，细节胡写",
			link : {
				"简介" : "简介",
				"配件" : "配件",
				"流程" : "流程",
				"结束" : "结束",
			},
			next : "简介",
		},
		"简介" : {
			title : "游戏背景",
			context : "欧洲神话 阿瓦隆",
			link : {
				"下一步" : "配件",
			},
			next : "配件",
		},
		"配件" : {
			title : "配件",
			context : "根据人数：<br>5人：5人任务板，1张梅林，2张骑士，1张刺客，1张奸徒<br>6人：……<br>……",
			link : {
				"下一步" : "流程",
			},
			next : "流程",
		},		
		"流程" : {
			title : "设置",
			context : "每人抽1张角色",
			link : {
				"下一步" : "身份分类",
			},
			next : "身份分类",
		},
		"身份分类" : {
			title : "身份分类",
			context : "梅林与骑士为正方，目的是尽力完成任务，并保证梅林身份未被识破<br>" +
				"刺客与张奸徒为反方，目的是尽力阻止任务完成，或刺客成功刺杀梅林",
			link : {
				"下一步" : "身份确认",
			},
			next : "身份确认",
		},
		"身份确认" : {
			title : "身份确认",
			context : "所有人闭眼<br>反方睁眼确认彼此身份，再所有人闭眼<br>" +
				"梅林睁眼，反方闭眼情况下伸手指供梅林确认身份，再所有人闭眼<br>所有人睁眼，开始游戏",
			link : {
				"下一步" : "游戏开始",
			},
			next : "游戏开始",
		},
		"游戏开始" : {
			title : "游戏开始",
			context : "任意玩家作为起始玩家，获得起始标记",
			link : {
				"下一步" : "回合开始",
			},
			next : "回合开始",
		},
		"回合开始" : {
			title : "回合开始",
			context : "当前起始玩家（拥有起始标记），按照任务板上当前任务的所需人物数量，将对应数量派遣标记分配给自己选择的玩家",
			link : {
				"下一步" : "派遣讨论",
			},
			next : "派遣讨论",
		},
		"派遣讨论" : {
			title : "派遣讨论",
			context : "所有人根据本回合派遣情况进行讨论",
			link : {
				"下一步" : "派遣投票",
			},
			next : "派遣投票",
		},
		"派遣投票" : {
			title : "派遣投票",
			context : "所有人根据本回合派遣情况进行投票<br>若达到半数或以上，则派遣成功，进行任务结果<br>否则派遣失败，设置失败标志",
			link : {
				"派遣成功" : "任务投票",
				"派遣失败" : "派遣失败",
			},
			next : "任务投票",
		},
		"任务投票" : {
			title : "任务投票",
			context : "所有派遣玩家暗投任务结果<br>正方必须投成功<br>反方可以投成功也可以投失败<br>投票结果中有一张失败，即任务失败<br>全部为成功，则任务成功",
			link : {
				"下一步" : "任务结果",
			},
			next : "任务结果",
		},
		"任务结果" : {
			title : "任务结果",
			context : "在任务板上放置结果标志，若达到一方任务数要求，则游戏结束。否则本回合结束",
			link : {
				"达到游戏结束要求" : "结束",
				"未达到要求" : "回合结束",
			},
			next : "派遣失败",
		},
		"派遣失败" : {
			title : "派遣失败",
			context : "在任务板上放置派遣失败标志。<br>若标志达到5个，则清除所有派遣失败标志，并设置该任务失败。<br>" +
			"若任务失败数目达到反方要求，则游戏结束。否则本回合结束",
			link : {
				"达到游戏结束要求" : "结束",
				"未达到要求" : "回合结束",
			},
			next : "回合结束",
		},
		"回合结束" : {
			title : "回合结束",
			context : "当前玩家传递起始标记，并开始下一回合",
			link : {
				"下一回合" : "回合开始",
			},
			next : "结束",
		},
		"结束" : {
			title : "结束",
			context : "正方达到任务要求时：反方刺客可以尝试选择一位玩家进行刺杀。成功选中梅林时，则反方获胜，否则正方获胜<br>" +
			"反方达到任务要求时，则反方获胜<br>游戏结束",
			link : {
				"回到开头" : "入口",
			},
		},
	},
};

module.exports = JSON.stringify(gameMod);
